import random as r
print("Добро пожаловать в Викторину")
print("Ты должен ввести название столиц стран, которые появятся на экране(с большой буквы!)")
print("Для осатновки игры в место столицы введи Stop")
plus = 0
minus = 0
hochet = True
strani = dict(
    Абхазия = "Сухум",
    Египет = "Каир",
    США = "Вашингтон",
    Уганда = "Кампала",
    Польша = "Варшава",
    Кипр = "Никосия",
    Исландия = "Рейкьявик",
    Мексика = "Мехико",
    Чехия = "Прага",
    Куба = "Гавана",
    Россия = "Москва",
    Финляндия = "Хельсинки",
    Ирландия = "Дублин",
    Румыния = "Бухарест",
    Канада = "Оттава",
    Эстония = "Таллин",
    Южная_Корея = "Сеул")
while hochet:
    country, stolit = r.choice(list(strani.items()))
    print(country)
    otvet = str(input("Столица? "))
    if otvet == "Stop":
        print("Игра окончена")
        hochet = False
        break
    else:
        if otvet == stolit:
            print("Так держать!")
            plus += 1
        else:
            print("Неверно! Ответ:",stolit)
            minus += 1
    print("Счёт: +:", plus," -:", minus)
        
    


     


    
